In [ ]:
import pandas as pd

data = [1,2,3,4,5,6]
series=pd.Series(data)
print(series)

In [9]:
df = pd.DataFrame({
    'name': ["Temur", "Aziz"],
    'age': [18,14],
    'power': ['strong', 'stronger']
})

#print(df)

name = df["name"]
print(name)

age = df["age"]
print(age)

0    Temur
1     Aziz
Name: name, dtype: object
0    18
1    14
Name: age, dtype: int64

In [11]:
year18boys = df[df['age']==18]
print(year18boys)

    name  age   power
0  Temur   18  strong

In [ ]:
df_csv = pd.read_csv("data/customers-100.csv")

print(df_csv.head())

In [ ]:
# name=[row[3] for row in df1]
# print(name)
#print([column[3] for column in df1])
print(df_csv['First Name'])

0       Sheryl
1      Preston
2          Roy
3        Linda
4       Joanna
        ...
95        Karl
96        Lynn
97        Fred
98      Yvonne
99    Clarence
Name: First Name, Length: 100, dtype: object

In [37]:
#reading json file

df_json=pd.read_json("data/iris.json")
print(df_json)

header=[val for val in df_json]
print(header)

     sepalLength  sepalWidth  petalLength  petalWidth    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]
['sepalLength', 'sepalWidth', 'petalLength', 'petalWidth', 'species']

In [42]:
#reading exls file

df_excel=pd.read_excel("data/titanic.xlsx", sheet_name="Sheet1")
df_excel.head()
#print(df_excel)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [44]:
df_html=pd.read_html("https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_area")
len(df_html)

df_html[1]

,Unnamed: 0,Country / dependency,Total in km2 (mi2),Land in km2 (mi2),Water in km2 (mi2),% water,Unnamed: 6
0,â€“,Earth,"510,072,000 (196,940,000)","148,940,000 (57,506,000)","361,132,000 (139,434,000)",70.8,NaN
1,1,Russia,"17,098,246 (6,601,667)","16,376,870 (6,323,142)","721,380 (278,530)",4.2,[b]
2,â€“,Antarctica,"14,200,000 (5,480,000)","14,200,000 (5,480,000)",0,0.0,[c]
3,2,Canada,"9,984,670 (3,855,100)","9,093,507 (3,511,021)","891,163 (344,080)",8.9,[d]
4,3/4 [e],China,"9,596,960 (3,705,410)","9,326,410 (3,600,950)","270,550 (104,460)",2.8,[f]
...,...,...,...,...,...,...,...
259,â€“,Ashmore and Cartier Islands (Australia),5.0 (1.9),5.0 (1.9),0,0.0,[q]
260,â€“,Coral Sea Islands (Australia),3.0 (1.2),3.0 (1.2),0,0.0,[db]
261,â€“,Spratly Islands (disputed),2.0 (0.77),2.0 (0.77),0,0.0,[55]
262,194,Monaco,2.0 (0.77),2.0 (0.77),0,0.0,[dc]
263,195,Vatican City,0.49 (0.19),0.49 (0.19),0,0.0,[dd]

In [ ]:
import pandas as pd

flights = pd.read_parquet("data/flights")

In [16]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("data/chinook.db")

df_employees = pd.read_sql("SELECT * FROM employees", conn)
#print(df_employees)
df_employees.head()

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [17]:
# with sqlite3.connect("data/chinook.db") as connection:
#     df_employee = pd.read_sql_table(table_name="employees", con=connection)
df_employees.head(3)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com

In [10]:
from sqlalchemy import create_engine

SERVER_NAME = 'Lenovo'
DATABASE_NAME = 'BikeStores'
DRIVER = 'ODBC+Driver+17+for+SQL+Server'
CONNECTION_STRING = f'mssql+pyodbc://{SERVER_NAME}/{DATABASE_NAME}?trusted_connection=yes&driver={DRIVER}'
print(CONNECTION_STRING)

mssql+pyodbc://Lenovo/BikeStores?trusted_connection=yes&driver=ODBC+Driver+17+for+SQL+Server

In [15]:
ms_sql_engine = create_engine(CONNECTION_STRING)
df_brands = pd.read_sql(
    "SELECT * FROM production.brands",
    con=ms_sql_engine
)

InterfaceError: (pyodbc.InterfaceError) ('IM002', '[IM002] [Microsoft][ODBC Driver Manager] Data source name not found and no default driver specified (0) (SQLDriverConnect)')
(Background on this error at: https://sqlalche.me/e/20/rvf5)

In [36]:
#convert lists to dictionary
import pandas as pd
values = [
    ["Temur", "Xazratqulov", 18],
    ["Aziz", "Xazratqulov",14],
    ["Muhammad", "Xazratqulov", 17],
    ["Jamshid", "Pirmatov",13],
    ["Javlon", "Pirmatov", 8]
]

label = ["First name", "Last name", "Age"]

df_dict = pd.DataFrame(data=values, columns=label)
df_dict

  First name    Last name  Age
0      Temur  Xazratqulov   18
1       Aziz  Xazratqulov   14
2   Muhammad  Xazratqulov   17
3    Jamshid     Pirmatov   13
4     Javlon     Pirmatov    8

In [38]:
member=df_dict[df_dict["First name"]=="Temur"]
print(member)

  First name    Last name  Age
0      Temur  Xazratqulov   18

In [39]:
df_dict.head() #this gives first 5 members, we can write arguments

  First name    Last name  Age
0      Temur  Xazratqulov   18
1       Aziz  Xazratqulov   14
2   Muhammad  Xazratqulov   17
3    Jamshid     Pirmatov   13
4     Javlon     Pirmatov    8

In [ ]:
df_dict.tail(2)  #this gives last members, if blank, shows 5 ones

  Firt name Last name  Age
3   Jamshid  Pirmatov   13
4    Javlon  Pirmatov    8

In [ ]:
df_dict.sample(2) #random

  Firt name    Last name  Age
3   Jamshid     Pirmatov   13
0     Temur  Xazratqulov   18

In [18]:
df_dict.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Firt name  5 non-null      object
 1   Last name  5 non-null      object
 2   Age        5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

In [19]:
df_dict.describe()

             Age
count   5.000000
mean   14.000000
std     3.937004
min     8.000000
25%    13.000000
50%    14.000000
75%    17.000000
max    18.000000

In [ ]:
len(df_dict) #length

5

In [21]:
df_dict.shape

(5, 3)

In [22]:
df_dict.dtypes

Firt name    object
Last name    object
Age           int64
dtype: object

In [41]:
df_dict.columns #columns

Index(['first name', 'last name', 'age'], dtype='object')

In [59]:
new_columns = [label.lower() for label in df_dict.columns]
df_dict.columns= new_columns #assigning new columns

In [42]:
df_dict.index

RangeIndex(start=0, stop=5, step=1)

In [58]:
df_dict.to_csv("data/members.csv", index=False)
import pandas as pd


df_members = pd.read_csv("data/members.csv")
df_members["ID"]=range(1,len(df_members)+1)
df_members.set_index("ID", inplace=True)
df_members

   first name    last name  age
ID
1       Temur  Xazratqulov   18
2        Aziz  Xazratqulov   14
3    Muhammad  Xazratqulov   17
4     Jamshid     Pirmatov   13
5      Javlon     Pirmatov    8

In [34]:
df_members.index

Index([1, 2, 3, 4, 5], dtype='int64', name='ID')

In [60]:
df_members["first name"]

ID
1       Temur
2        Aziz
3    Muhammad
4     Jamshid
5      Javlon
Name: first name, dtype: object

In [61]:
df_members[["first name", "age"]] #we can show members' specific details

   first name  age
ID
1       Temur   18
2        Aziz   14
3    Muhammad   17
4     Jamshid   13
5      Javlon    8

In [62]:
df_members.describe()

             age
count   5.000000
mean   14.000000
std     3.937004
min     8.000000
25%    13.000000
50%    14.000000
75%    17.000000
max    18.000000

In [63]:
import numpy as np

df_members['age'].sort_values(ascending=True)

ID
5     8
4    13
2    14
3    17
1    18
Name: age, dtype: int64

In [65]:
df_members['age'].notnull() #check if palces are not empty

ID
1    True
2    True
3    True
4    True
5    True
Name: age, dtype: bool

In [66]:
df_members[df_members['age'].isnull()]

Empty DataFrame
Columns: [first name, last name, age]
Index: []

In [68]:
df_members.isna() #any blank places

    first name  last name    age
ID
1        False      False  False
2        False      False  False
3        False      False  False
4        False      False  False
5        False      False  False

In [ ]:
df_members.select_dtypes('object') #string values

   first name    last name
ID
1       Temur  Xazratqulov
2        Aziz  Xazratqulov
3    Muhammad  Xazratqulov
4     Jamshid     Pirmatov
5      Javlon     Pirmatov